tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf458_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF458_H_
#define _PIC18LF458_H_

#define RXF0SIDH                      0
#define RXF0SID3                      1
#define RXF0SIDH_SID3                 2
#define RXF0SID4                      3
#define RXF0SIDH_SID4                 4
#define RXF0SID5                      5
#define RXF0SIDH_SID5                 6
#define RXF0SID6                      7
#define RXF0SIDH_SID6                 8
#define RXF0SID7                      9
#define RXF0SIDH_SID7                 10
#define RXF0SID8                      11
#define RXF0SIDH_SID8                 12
#define RXF0SID9                      13
#define RXF0SIDH_SID9                 14
#define RXF0SID10                     15
#define RXF0SIDH_SID10                16
#define RXF0SIDL                      17
#define RXF0SIDL_EID16                18
#define RXF0EID16                     19
#define RXF0SIDL_EID17                20
#define RXF0EID17                     21
#define RXF0EXIDEN                    22
#define RXF0SIDL_EXIDEN               23
#define RXF0SID0                      24
#define RXF0SIDL_SID0                 25
#define RXF0SID1                      26
#define RXF0SIDL_SID1                 27
#define RXF0SID2                      28
#define RXF0SIDL_SID2                 29
#define RXF0EIDH                      30
#define RXF0EIDH_EID8                 31
#define RXF0EID8                      32
#define RXF0EIDH_EID9                 33
#define RXF0EID9                      34
#define RXF0EIDH_EID10                35
#define RXF0EID10                     36
#define RXF0EIDH_EID11                37
#define RXF0EID11                     38
#define RXF0EIDH_EID12                39
#define RXF0EID12                     40
#define RXF0EIDH_EID13                41
#define RXF0EID13                     42
#define RXF0EIDH_EID14                43
#define RXF0EID14                     44
#define RXF0EIDH_EID15                45
#define RXF0EID15                     46
#define RXF0EIDL                      47
#define RXF0EIDL_EID0                 48
#define RXF0EID0                      49
#define RXF0EIDL_EID1                 50
#define RXF0EID1                      51
#define RXF0EIDL_EID2                 52
#define RXF0EID2                      53
#define RXF0EIDL_EID3                 54
#define RXF0EID3                      55
#define RXF0EIDL_EID4                 56
#define RXF0EID4                      57
#define RXF0EIDL_EID5                 58
#define RXF0EID5                      59
#define RXF0EIDL_EID6                 60
#define RXF0EID6                      61
#define RXF0EIDL_EID7                 62
#define RXF0EID7                      63
#define RXF1SIDH                      64
#define RXF1SID3                      65
#define RXF1SIDH_SID3                 66
#define RXF1SID4                      67
#define RXF1SIDH_SID4                 68
#define RXF1SID5                      69
#define RXF1SIDH_SID5                 70
#define RXF1SID6                      71
#define RXF1SIDH_SID6                 72
#define RXF1SID7                      73
#define RXF1SIDH_SID7                 74
#define RXF1SID8                      75
#define RXF1SIDH_SID8                 76
#define RXF1SID9                      77
#define RXF1SIDH_SID9                 78
#define RXF1SIDH_SID10                79
#define RXF1SID10                     80
#define RXF1SIDL                      81
#define RXF1SIDL_EID16                82
#define RXF1EID16                     83
#define RXF1EID17                     84
#define RXF1SIDL_EID17                85
#define RXF1EXIDEN                    86
#define RXF1SIDL_EXIDEN               87
#define RXF1SIDL_SID0                 88
#define RXF1SID0                      89
#define RXF1SIDL_SID1                 90
#define RXF1SID1                      91
#define RXF1SID2                      92
#define RXF1SIDL_SID2                 93
#define RXF1EIDH                      94
#define RXF1EID8                      95
#define RXF1EIDH_EID8                 96
#define RXF1EID9                      97
#define RXF1EIDH_EID9                 98
#define RXF1EIDH_EID10                99
#define RXF1EID10                     100
#define RXF1EIDH_EID11                101
#define RXF1EID11                     102
#define RXF1EIDH_EID12                103
#define RXF1EID12                     104
#define RXF1EIDH_EID13                105
#define RXF1EID13                     106
#define RXF1EIDH_EID14                107
#define RXF1EID14                     108
#define RXF1EIDH_EID15                109
#define RXF1EID15                     110
#define RXF1EIDL                      111
#define RXF1EID0                      112
#define RXF1EIDL_EID0                 113
#define RXF1EID1                      114
#define RXF1EIDL_EID1                 115
#define RXF1EID2                      116
#define RXF1EIDL_EID2                 117
#define RXF1EID3                      118
#define RXF1EIDL_EID3                 119
#define RXF1EID4                      120
#define RXF1EIDL_EID4                 121
#define RXF1EID5                      122
#define RXF1EIDL_EID5                 123
#define RXF1EID6                      124
#define RXF1EIDL_EID6                 125
#define RXF1EIDL_EID7                 126
#define RXF1EID7                      127
#define RXF2SIDH                      128
#define RXF2SID3                      129
#define RXF2SIDH_SID3                 130
#define RXF2SID4                      131
#define RXF2SIDH_SID4                 132
#define RXF2SID5                      133
#define RXF2SIDH_SID5                 134
#define RXF2SID6                      135
#define RXF2SIDH_SID6                 136
#define RXF2SID7                      137
#define RXF2SIDH_SID7                 138
#define RXF2SID8                      139
#define RXF2SIDH_SID8                 140
#define RXF2SID9                      141
#define RXF2SIDH_SID9                 142
#define RXF2SID10                     143
#define RXF2SIDH_SID10                144
#define RXF2SIDL                      145
#define RXF2SIDL_EID16                146
#define RXF2EID16                     147
#define RXF2SIDL_EID17                148
#define RXF2EID17                     149
#define RXF2EXIDEN                    150
#define RXF2SIDL_EXIDEN               151
#define RXF2SID0                      152
#define RXF2SIDL_SID0                 153
#define RXF2SID1                      154
#define RXF2SIDL_SID1                 155
#define RXF2SID2                      156
#define RXF2SIDL_SID2                 157
#define RXF2EIDH                      158
#define RXF2EID8                      159
#define RXF2EIDH_EID8                 160
#define RXF2EID9                      161
#define RXF2EIDH_EID9                 162
#define RXF2EID10                     163
#define RXF2EIDH_EID10                164
#define RXF2EIDH_EID11                165
#define RXF2EID11                     166
#define RXF2EIDH_EID12                167
#define RXF2EID12                     168
#define RXF2EIDH_EID13                169
#define RXF2EID13                     170
#define RXF2EIDH_EID14                171
#define RXF2EID14                     172
#define RXF2EIDH_EID15                173
#define RXF2EID15                     174
#define RXF2EIDL                      175
#define RXF2EID0                      176
#define RXF2EIDL_EID0                 177
#define RXF2EID1                      178
#define RXF2EIDL_EID1                 179
#define RXF2EID2                      180
#define RXF2EIDL_EID2                 181
#define RXF2EID3                      182
#define RXF2EIDL_EID3                 183
#define RXF2EID4                      184
#define RXF2EIDL_EID4                 185
#define RXF2EID5                      186
#define RXF2EIDL_EID5                 187
#define RXF2EID6                      188
#define RXF2EIDL_EID6                 189
#define RXF2EID7                      190
#define RXF2EIDL_EID7                 191
#define RXF3SIDH                      192
#define RXF3SID3                      193
#define RXF3SIDH_SID3                 194
#define RXF3SIDH_SID4                 195
#define RXF3SID4                      196
#define RXF3SIDH_SID5                 197
#define RXF3SID5                      198
#define RXF3SIDH_SID6                 199
#define RXF3SID6                      200
#define RXF3SIDH_SID7                 201
#define RXF3SID7                      202
#define RXF3SIDH_SID8                 203
#define RXF3SID8                      204
#define RXF3SIDH_SID9                 205
#define RXF3SID9                      206
#define RXF3SID10                     207
#define RXF3SIDH_SID10                208
#define RXF3SIDL                      209
#define RXF3SIDL_EID16                210
#define RXF3EID16                     211
#define RXF3EID17                     212
#define RXF3SIDL_EID17                213
#define RXF3SIDL_EXIDEN               214
#define RXF3EXIDEN                    215
#define RXF3SIDL_SID0                 216
#define RXF3SID0                      217
#define RXF3SIDL_SID1                 218
#define RXF3SID1                      219
#define RXF3SIDL_SID2                 220
#define RXF3SID2                      221
#define RXF3EIDH                      222
#define RXF3EIDH_EID8                 223
#define RXF3EID8                      224
#define RXF3EIDH_EID9                 225
#define RXF3EID9                      226
#define RXF3EIDH_EID10                227
#define RXF3EID10                     228
#define RXF3EIDH_EID11                229
#define RXF3EID11                     230
#define RXF3EIDH_EID12                231
#define RXF3EID12                     232
#define RXF3EIDH_EID13                233
#define RXF3EID13                     234
#define RXF3EIDH_EID14                235
#define RXF3EID14                     236
#define RXF3EIDH_EID15                237
#define RXF3EID15                     238
#define RXF3EIDL                      239
#define RXF3EID0                      240
#define RXF3EIDL_EID0                 241
#define RXF3EID1                      242
#define RXF3EIDL_EID1                 243
#define RXF3EID2                      244
#define RXF3EIDL_EID2                 245
#define RXF3EID3                      246
#define RXF3EIDL_EID3                 247
#define RXF3EID4                      248
#define RXF3EIDL_EID4                 249
#define RXF3EID5                      250
#define RXF3EIDL_EID5                 251
#define RXF3EID6                      252
#define RXF3EIDL_EID6                 253
#define RXF3EID7                      254
#define RXF3EIDL_EID7                 255
#define RXF4SIDH                      256
#define RXF4SID3                      257
#define RXF4SIDH_SID3                 258
#define RXF4SID4                      259
#define RXF4SIDH_SID4                 260
#define RXF4SID5                      261
#define RXF4SIDH_SID5                 262
#define RXF4SID6                      263
#define RXF4SIDH_SID6                 264
#define RXF4SID7                      265
#define RXF4SIDH_SID7                 266
#define RXF4SID8                      267
#define RXF4SIDH_SID8                 268
#define RXF4SID9                      269
#define RXF4SIDH_SID9                 270
#define RXF4SIDH_SID10                271
#define RXF4SID10                     272
#define RXF4SIDL                      273
#define RXF4EID16                     274
#define RXF4SIDL_EID16                275
#define RXF4EID17                     276
#define RXF4SIDL_EID17                277
#define RXF4SIDL_EXIDEN               278
#define RXF4EXIDEN                    279
#define RXF4SID0                      280
#define RXF4SIDL_SID0                 281
#define RXF4SIDL_SID1                 282
#define RXF4SID1                      283
#define RXF4SID2                      284
#define RXF4SIDL_SID2                 285
#define RXF4EIDH                      286
#define RXF4EID8                      287
#define RXF4EIDH_EID8                 288
#define RXF4EID9                      289
#define RXF4EIDH_EID9                 290
#define RXF4EID10                     291
#define RXF4EIDH_EID10                292
#define RXF4EID11                     293
#define RXF4EIDH_EID11                294
#define RXF4EID12                     295
#define RXF4EIDH_EID12                296
#define RXF4EID13                     297
#define RXF4EIDH_EID13                298
#define RXF4EID14                     299
#define RXF4EIDH_EID14                300
#define RXF4EID15                     301
#define RXF4EIDH_EID15                302
#define RXF4EIDL                      303
#define RXF4EID0                      304
#define RXF4EIDL_EID0                 305
#define RXF4EID1                      306
#define RXF4EIDL_EID1                 307
#define RXF4EID2                      308
#define RXF4EIDL_EID2                 309
#define RXF4EID3                      310
#define RXF4EIDL_EID3                 311
#define RXF4EID4                      312
#define RXF4EIDL_EID4                 313
#define RXF4EID5                      314
#define RXF4EIDL_EID5                 315
#define RXF4EID6                      316
#define RXF4EIDL_EID6                 317
#define RXF4EID7                      318
#define RXF4EIDL_EID7                 319
#define RXF5SIDH                      320
#define RXF5SIDH_SID3                 321
#define RXF5SID3                      322
#define RXF5SIDH_SID4                 323
#define RXF5SID4                      324
#define RXF5SIDH_SID5                 325
#define RXF5SID5                      326
#define RXF5SIDH_SID6                 327
#define RXF5SID6                      328
#define RXF5SIDH_SID7                 329
#define RXF5SID7                      330
#define RXF5SIDH_SID8                 331
#define RXF5SID8                      332
#define RXF5SIDH_SID9                 333
#define RXF5SID9                      334
#define RXF5SIDH_SID10                335
#define RXF5SID10                     336
#define RXF5SIDL                      337
#define RXF5EID16                     338
#define RXF5SIDL_EID16                339
#define RXF5EID17                     340
#define RXF5SIDL_EID17                341
#define RXF5SIDL_EXIDEN               342
#define RXF5EXIDEN                    343
#define RXF5SIDL_SID0                 344
#define RXF5SID0                      345
#define RXF5SID1                      346
#define RXF5SIDL_SID1                 347
#define RXF5SIDL_SID2                 348
#define RXF5SID2                      349
#define RXF5EIDH                      350
#define RXF5EIDH_EID8                 351
#define RXF5EID8                      352
#define RXF5EIDH_EID9                 353
#define RXF5EID9                      354
#define RXF5EIDH_EID10                355
#define RXF5EID10                     356
#define RXF5EIDH_EID11                357
#define RXF5EID11                     358
#define RXF5EIDH_EID12                359
#define RXF5EID12                     360
#define RXF5EIDH_EID13                361
#define RXF5EID13                     362
#define RXF5EIDH_EID14                363
#define RXF5EID14                     364
#define RXF5EIDH_EID15                365
#define RXF5EID15                     366
#define RXF5EIDL                      367
#define RXF5EIDL_EID0                 368
#define RXF5EID0                      369
#define RXF5EIDL_EID1                 370
#define RXF5EID1                      371
#define RXF5EIDL_EID2                 372
#define RXF5EID2                      373
#define RXF5EIDL_EID3                 374
#define RXF5EID3                      375
#define RXF5EIDL_EID4                 376
#define RXF5EID4                      377
#define RXF5EIDL_EID5                 378
#define RXF5EID5                      379
#define RXF5EIDL_EID6                 380
#define RXF5EID6                      381
#define RXF5EIDL_EID7                 382
#define RXF5EID7                      383
#define RXM0SIDH                      384
#define RXM0SIDH_SID3                 385
#define RXM0SID3                      386
#define RXM0SIDH_SID4                 387
#define RXM0SID4                      388
#define RXM0SIDH_SID5                 389
#define RXM0SID5                      390
#define RXM0SIDH_SID6                 391
#define RXM0SID6                      392
#define RXM0SIDH_SID7                 393
#define RXM0SID7                      394
#define RXM0SIDH_SID8                 395
#define RXM0SID8                      396
#define RXM0SIDH_SID9                 397
#define RXM0SID9                      398
#define RXM0SID10                     399
#define RXM0SIDH_SID10                400
#define RXM0SIDL                      401
#define RXM0SIDL_EID16                402
#define RXM0EID16                     403
#define RXM0EID17                     404
#define RXM0SIDL_EID17                405
#define RXM0SID0                      406
#define RXM0SIDL_SID0                 407
#define RXM0SID1                      408
#define RXM0SIDL_SID1                 409
#define RXM0SID2                      410
#define RXM0SIDL_SID2                 411
#define RXM0EIDH                      412
#define RXM0EIDH_EID8                 413
#define RXM0EID8                      414
#define RXM0EIDH_EID9                 415
#define RXM0EID9                      416
#define RXM0EIDH_EID10                417
#define RXM0EID10                     418
#define RXM0EIDH_EID11                419
#define RXM0EID11                     420
#define RXM0EIDH_EID12                421
#define RXM0EID12                     422
#define RXM0EIDH_EID13                423
#define RXM0EID13                     424
#define RXM0EIDH_EID14                425
#define RXM0EID14                     426
#define RXM0EIDH_EID15                427
#define RXM0EID15                     428
#define RXM0EIDL                      429
#define RXM0EIDL_EID0                 430
#define RXM0EID0                      431
#define RXM0EIDL_EID1                 432
#define RXM0EID1                      433
#define RXM0EIDL_EID2                 434
#define RXM0EID2                      435
#define RXM0EIDL_EID3                 436
#define RXM0EID3                      437
#define RXM0EIDL_EID4                 438
#define RXM0EID4                      439
#define RXM0EIDL_EID5                 440
#define RXM0EID5                      441
#define RXM0EIDL_EID6                 442
#define RXM0EID6                      443
#define RXM0EIDL_EID7                 444
#define RXM0EID7                      445
#define RXM1SIDH                      446
#define RXM1SID3                      447
#define RXM1SIDH_SID3                 448
#define RXM1SID4                      449
#define RXM1SIDH_SID4                 450
#define RXM1SID5                      451
#define RXM1SIDH_SID5                 452
#define RXM1SID6                      453
#define RXM1SIDH_SID6                 454
#define RXM1SID7                      455
#define RXM1SIDH_SID7                 456
#define RXM1SIDH_SID8                 457
#define RXM1SID8                      458
#define RXM1SID9                      459
#define RXM1SIDH_SID9                 460
#define RXM1SIDH_SID10                461
#define RXM1SID10                     462
#define RXM1SIDL                      463
#define RXM1SIDL_EID16                464
#define RXM1EID16                     465
#define RXM1SIDL_EID17                466
#define RXM1EID17                     467
#define RXM1SID0                      468
#define RXM1SIDL_SID0                 469
#define RXM1SID1                      470
#define RXM1SIDL_SID1                 471
#define RXM1SID2                      472
#define RXM1SIDL_SID2                 473
#define RXM1EIDH                      474
#define RXM1EID8                      475
#define RXM1EIDH_EID8                 476
#define RXM1EID9                      477
#define RXM1EIDH_EID9                 478
#define RXM1EIDH_EID10                479
#define RXM1EID10                     480
#define RXM1EIDH_EID11                481
#define RXM1EID11                     482
#define RXM1EIDH_EID12                483
#define RXM1EID12                     484
#define RXM1EIDH_EID13                485
#define RXM1EID13                     486
#define RXM1EIDH_EID14                487
#define RXM1EID14                     488
#define RXM1EIDH_EID15                489
#define RXM1EID15                     490
#define RXM1EIDL                      491
#define RXM1EID0                      492
#define RXM1EIDL_EID0                 493
#define RXM1EID1                      494
#define RXM1EIDL_EID1                 495
#define RXM1EID2                      496
#define RXM1EIDL_EID2                 497
#define RXM1EID3                      498
#define RXM1EIDL_EID3                 499
#define RXM1EIDL_EID4                 500
#define RXM1EID4                      501
#define RXM1EIDL_EID5                 502
#define RXM1EID5                      503
#define RXM1EID6                      504
#define RXM1EIDL_EID6                 505
#define RXM1EID7                      506
#define RXM1EIDL_EID7                 507
#define TXB2CON                       508
#define TXB2PRI0                      509
#define TXB2CON_TXPRI0                510
#define TXB2PRI1                      511
#define TXB2CON_TXPRI1                512
#define TXB2REQ                       513
#define TXB2CON_TXREQ                 514
#define TXB2ERR                       515
#define TXB2CON_TXERR                 516
#define TXB2CON_TXLARB                517
#define TXB2LARB                      518
#define TXB2ABT                       519
#define TXB2CON_TXABT                 520
#define TXB2SIDH                      521
